modules/shared/config/emacs/config.el
(setq user-full-name "Alexey Kotomin"
  user-mail-address "a.kotominn@gmail.com")

(require 'package)
(unless (assoc-default "melpa" package-archives)
   (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t))
(unless (assoc-default "nongnu" package-archives)
   (add-to-list 'package-archives '("nongnu" . "https://elpa.nongnu.org/nongnu/") t))

(defun system-is-mac ()
  "Return true if system is darwin-based (Mac OS X)"
  (string-equal system-type "darwin"))

(defun system-is-linux ()
  "Return true if system is GNU/Linux-based"
  (string-equal system-type "gnu/linux"))

;; Set path for darwin
(when (system-is-mac)
  (let ((home-dir (getenv "HOME")))
    (setenv "PATH" (concat (getenv "PATH") ":" home-dir "/.nix-profile/bin:/usr/bin"))
    (setq exec-path (append (list (concat home-dir "/bin")
                                 "/profile/bin"
                                 (concat home-dir "/.npm-packages/bin")
                                 (concat home-dir "/.nix-profile/bin")
                                 "/nix/var/nix/profiles/default/bin"
                                 "/usr/local/bin"
                                 "/usr/bin")
                           exec-path))))

;; Turn off UI junk
(column-number-mode)
(scroll-bar-mode 0)
(menu-bar-mode -1)
(tool-bar-mode 0)
(winner-mode 1) ;; ctrl-c left, ctrl-c right for window undo/redo
(blink-cursor-mode -1)

;; Для более плавной работы с оконным менеджером:
(setq frame-resize-pixelwise t)  ; Точность в пикселях (может быть полезно)
;; (setq frame-inhibit-implied-resize t)  ; Не менять размер автоматически

(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))

(use-package nerd-icons)

;; f.el - modern file API
(use-package f
  :ensure nil  ; Managed by Nix
  :demand t)

(use-package doom-modeline
  :ensure nil  ; Managed by Nix
  :after f
  :init (doom-modeline-mode 1))

;; Remove binding for facemap-menu, use for ace-window instead
(global-unset-key (kbd "M-o"))

(use-package ace-window
  :bind (("M-o" . ace-window))
  :custom
    (aw-scope 'frame)
    (aw-keys '(?a ?r ?s ?t ?g ?m ?n ?e ?i ?o))
    (aw-minibuffer-flag t)
  :config
    (ace-window-display-mode 1)
    (advice-add 'ace-select-window :after #'win/auto-resize))

;;; Set default frame size and position 
(setq inhibit-startup-screen t)
(setq initial-scratch-message nil)
(setq confirm-kill-emacs #'y-or-n-p)

  ;; Smooth out garbage collection
  (use-package gcmh
    :ensure nil  ; Managed by Nix
    :demand t
    :config
    (gcmh-mode 1))

(save-place-mode 1)
(setq save-place-file "~/.local/state/emacs/saveplace")

(savehist-mode 1)
(setq savehist-additional-variables
  '(search-ring
    regexp-search-ring
    kill-ring
    register-alist
    org-refile-history
    org-capture-history))
(setq savehist-file "~/.local/state/emacs/savehist")

(use-package recentf
  :ensure nil
  :init
  (setq recentf-max-saved-items 100
    recentf-max-menu-items 50
    recentf-save-file "~/.local/state/emacs/recentf")
  :config
    (recentf-mode 1))

(global-set-key (kbd "C-x C-r") 'recentf-open-files)

;;;; Fontaine (font configurations)
(use-package fontaine
  :ensure nil 
  :hook
  ;; Persist the latest font preset when closing/starting Emacs.
  ((after-init . fontaine-mode)
   (after-init . (lambda ()
                   ;; Set last preset or fall back to desired style from `fontaine-presets'.
                   (fontaine-set-preset (or (fontaine-restore-latest-preset) 'regular)))))
  :bind (("C-c f" . fontaine-set-preset)
         ("C-c F" . fontaine-toggle-preset))
  :config
;; Главные семейства для macOS
(defconst my/mono "Geist Mono")
(defconst my/var  "SF Pro Text") ; можно сменить на "San Francisco" / "Inter"

;; Набор пресетов. Высоты — в “сотых” по классике Emacs: 140 ≈ 14pt.
(setq fontaine-presets
      `(
        ;; компактный
        (small
         :default-family ,my/mono
         :default-weight light 
         :default-height 110
         :fixed-pitch-family ,my/mono
         :variable-pitch-family ,my/var)

        ;; по умолчанию
        (regular
         :default-family ,my/mono
         :default-weight regular 
         :default-height 140
         :fixed-pitch-family ,my/mono
         :variable-pitch-family ,my/var)

        ;; слегка крупнее
        (medium
         :inherit regular
         :default-height 150)

        ;; заметно крупнее — удобно на ретине/диване
        (large
         :inherit regular
         :default-height 170)

        ;; для выступлений
        (presentation
         :inherit regular
         :default-height 190)

        ;; максимальный
        (jumbo
         :inherit regular
         :default-height 230)

        ;; пресет для кодинга: немного компактнее боксы UI
        (coding
         :inherit regular
         :default-height 135)

        ;; fallback по умолчанию (используется как база для наследования)
        (t
         :default-family ,my/mono
         :default-weight regular
         :default-slant normal
         :default-width normal
         :default-height 140

         :fixed-pitch-family ,my/mono
         :fixed-pitch-height 1.0

         :variable-pitch-family ,my/var
         :variable-pitch-height 1.0

         :mode-line-active-height 1.0
         :mode-line-inactive-height 1.0
         :header-line-height 1.0
         :line-number-height 1.0
         :tab-bar-height 1.0
         :tab-line-height 1.0
         :bold-weight bold
         :italic-slant italic)))

  (with-eval-after-load 'pulsar
    (add-hook 'fontaine-set-preset-hook #'pulsar-pulse-line)))

(require 'spacious-padding)

;; These are the default values, but I keep them here for visibility.
(setq spacious-padding-widths
      '( :internal-border-width 15
         :header-line-width 4
         :mode-line-width 6
         :tab-width 4
         :right-divider-width 30
         :scroll-bar-width 8
         :fringe-width 8))

;; Read the doc string of `spacious-padding-subtle-mode-line' as it
;; is very flexible and provides several examples.
(setq spacious-padding-subtle-frame-lines
      `( :mode-line-active 'default
         :mode-line-inactive vertical-border))

(spacious-padding-mode 1)

;; Set a key binding if you need to toggle spacious padding.
(define-key global-map (kbd "<f8>") #'spacious-padding-mode)
