modules/shared/config/emacs/config.el

(use-package dashboard
  :ensure nil  ; Managed by Nix
  :config
  (dashboard-setup-startup-hook)
  (setq dashboard-startup-banner 'ascii
        dashboard-center-content t
        dashboard-items '((projects . 5)
                           (recents  . 5)))
  (setq dashboard-set-footer nil))

  (setq dashboard-banner-logo-title "This is your life")
  (setq dashboard-set-file-icons t)
  ;; (setq dashboard-projects-backend 'projectile)

  (setq initial-buffer-choice (lambda ()
                                  (get-buffer-create "*dashboard*")
                                  (dashboard-refresh-buffer)))

(global-set-key (kbd "<C-tab>") 'next-buffer)

;; Needed for `:after char-fold' to work
(use-package char-fold
  :custom
  (char-fold-symmetric t)
  (search-default-mode #'char-fold-to-regexp))

(use-package reverse-im
  :ensure nil 
  :demand t ; always load it
  :after char-fold ; but only after `char-fold' is loaded
  :bind
  ("M-T" . reverse-im-translate-word) ; to fix a word written in the wrong layout
  :custom
  ;; cache generated keymaps
  (reverse-im-cache-file (locate-user-emacs-file "reverse-im-cache.el"))
  ;; use lax matching
  (reverse-im-char-fold t)
  ;; advice read-char to fix commands that use their own shortcut mechanism
  (reverse-im-read-char-advice-function #'reverse-im-read-char-include)
  ;; translate these methods
  (reverse-im-input-methods '("russian-computer" "greek"))
  :config
  (reverse-im-mode t)) ; turn the mode on

(when (require 'meow nil t)             
(require 'meow-tree-sitter nil t)   
(when (fboundp 'meow-setup)
  (meow-setup)
  (meow-global-mode 1)))

(require 'ef-themes)
(setq ef-themes-to-toggle '(ef-owl ef-maris-dark))
(setq ef-themes-headings ; read the manual's entry or the doc string
      '((0 variable-pitch regular 1.9)
        (1 variable-pitch regular 1.8)
        (2 variable-pitch light 1.7)
        (3 variable-pitch light 1.6)
        (4 variable-pitch light 1.5)
        (5 variable-pitch light 1.4) ; absence of weight means `bold'
        (6 variable-pitch light 1.3)
        (7 variable-pitch light 1.2)
        (t variable-pitch light 1.1)))

(setq ef-themes-mixed-fonts t
      ef-themes-variable-pitch-ui t)

(mapc #'disable-theme custom-enabled-themes)

(load-theme 'ef-owl :no-confirm)

(define-key global-map (kbd "<f5>") #'ef-themes-toggle)

;;;; Pulsar
;; Read the pulsar manual: <https://protesilaos.com/emacs/pulsar>.
(use-package pulsar
  :ensure nil
  :config
  (setq pulsar-pulse t
        pulsar-delay 0.055
        pulsar-iterations 5
        pulsar-face 'pulsar-green
        pulsar-region-face 'pulsar-cyan
        pulsar-highlight-face 'pulsar-magenta)
  ;; Pulse after `pulsar-pulse-region-functions'.
  (setq pulsar-pulse-region-functions pulsar-pulse-region-common-functions)
  :hook
  ;; There are convenience functions/commands which pulse the line using
  ;; a specific colour: `pulsar-pulse-line-red' is one of them.
  ((next-error . (pulsar-pulse-line-red pulsar-recenter-top pulsar-reveal-entry))
   (minibuffer-setup . pulsar-pulse-line-red)
   ;; Pulse right after the use of `pulsar-pulse-functions' and
   ;; `pulsar-pulse-region-functions'.  The default value of the
   ;; former user option is comprehensive.
   (after-init . pulsar-global-mode))
  :bind
  ;; pulsar does not define any key bindings.  This is just my personal
  ;; preference.  Remember to read the manual on the matter.  Evaluate:
  ;;
  ;; (info "(elisp) Key Binding Conventions")
  (("C-x l" . pulsar-pulse-line) ; override `count-lines-page'
   ("C-x L" . pulsar-highlight-dwim))) ; or use `pulsar-highlight-line'

;; The desired ratio of the focused window's size.
(setopt auto-resize-ratio 0.7)

(defun win/auto-resize ()
  (let* (
         (height (floor (* auto-resize-ratio (frame-height))))
         (width (floor (* auto-resize-ratio (frame-width))))
         ;; INFO We need to calculate by how much we should enlarge
         ;; focused window because Emacs does not allow setting the
         ;; window dimensions directly.
         (h-diff (max 0 (- height (window-height))))
         (w-diff (max 0 (- width (window-width)))))
    (enlarge-window h-diff)
    (enlarge-window w-diff t)))
(setopt window-min-height 10)
(setopt window-min-width 10)

(advice-add 'other-window :after (lambda (&rest args)
                                   (win/auto-resize)))

(advice-add 'windmove-up    :after 'win/auto-resize)
(advice-add 'windmove-down  :after 'win/auto-resize)
(advice-add 'windmove-right :after 'win/auto-resize)
(advice-add 'windmove-left  :after 'win/auto-resize)

(setq use-short-answers t)
(global-visual-line-mode t) ;; Wraps lines everywhere
(global-auto-revert-mode t) ;; Auto refresh buffers from disk

;; Настройка подсветки скобок
(show-paren-mode t)  ;; Включить режим
(setq show-paren-style 'mixed) ;; Лучшая видимость (выделение всей пары или одной)
(setq show-paren-delay 0)      ;; Мгновенная подсветка 

(setq warning-minimum-level :error)

;; Нумерация
(global-display-line-numbers-mode t)
(setq display-line-numbers-type 'relative)
