modules/shared/config/emacs/config.org
**** Leader key shortcuts
#+NAME::org-mode-quick-entry
#+BEGIN_SRC emacs-lisp

  ;; ESC will also cancel/quit/etc.
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)
  (use-package general
    :config
    ;; (general-evil-setup t)
    (general-create-definer dl/leader-keys
      :keymaps '(normal visual emacs)
      :prefix ","))

  (defvar current-time-format "%H:%M:%S"
    "Format of date to insert with `insert-current-time' func.
  Note the weekly scope of the command's precision.")

  (defun dl/find-file (path)
    "Helper function to open a file in a buffer"
    (interactive)
    (find-file path))

  (defun dl/load-buffer-with-emacs-config ()
    "Open the emacs configuration"
    (interactive)
    (dl/find-file "~/.local/share/src/nixos-config/modules/shared/config/emacs/config.org"))

  (defun dl/load-buffer-with-nix-config ()
    "Open the emacs configuration"
    (interactive)
    (dl/find-file "~/.local/share/src/nixos-config/modules/shared/home-manager.nix"))

  (defun dl/reload-emacs ()
    "Reload the emacs configuration"
    (interactive)
    (load "~/.emacs.d/init.el"))

  ;; Emacs relates shortcuts
  (dl/leader-keys
    "e"  '(:ignore t :which-key "emacs")
    "ee" '(dl/load-buffer-with-emacs-config :which-key "open emacs config")
    "er" '(dl/reload-emacs :which-key "reload emacs"))

  (with-eval-after-load 'org
    (let ((png (cdr (assoc 'dvipng org-preview-latex-process-alist))))
      (plist-put png :latex-compiler
  	       '("latex -interaction nonstopmode -output-directory %o %F"))
      (plist-put png :image-converter
  	       '("dvipng -D %D -T tight -o %O %F"))
      (plist-put png :transparent-image-converter
  	       '("dvipng -D %D -T tight -bg Transparent -o %O %F"))))

  (use-package math-preview
    :custom (math-preview-command "/Users/alexeykotomin/.nix-profile/bin/math-preview"))

  (use-package obsidian
    :config
    (global-obsidian-mode t)
    (obsidian-backlinks-mode t)
    :custom
    ;; location of obsidian vault
    (obsidian-directory "~/Documents/notes/obsidian")
    ;; Default location for new notes from `obsidian-capture'
    (obsidian-inbox-directory "Inbox")
    ;; Useful if you're going to be using wiki links
    (markdown-enable-wiki-links t)

    ;; These bindings are only suggestions; it's okay to use other bindings
    :bind (:map obsidian-mode-map
                ;; Create note
                ("C-c C-n" . obsidian-capture)
                ;; If you prefer you can use `obsidian-insert-wikilink'
                ("C-c C-l" . obsidian-insert-link)
                ;; Open file pointed to by link at point
                ("C-c C-o" . obsidian-follow-link-at-point)
                ;; Open a different note from vault
                ("C-c C-p" . obsidian-jump)
                ;; Follow a backlink for the current file
                ("C-c C-b" . obsidian-backlink-jump)))

#+END_SRC

*** UI improvements
**** Org-modern 
#+NAME::org-mode-visuals
#+BEGIN_SRC emacs-lisp
  
  (use-package org-modern
    :ensure nil 
    :config
      ;; Add frame borders and window dividers
      (modify-all-frames-parameters
      '((right-divider-width . 40)
      (internal-border-width . 40)))
      (dolist (face '(window-divider
                      window-divider-first-pixel
                      window-divider-last-pixel))
      (face-spec-reset-face face)
      (set-face-foreground face (face-attribute 'default :background)))
      (set-face-background 'fringe (face-attribute 'default :background))

      (setq
      ;; Edit settings
      org-auto-align-tags nil
      org-tags-column 0
      org-catch-invisible-edits 'show-and-error
      org-special-ctrl-a/e t
      org-insert-heading-respect-content t

      ;; Org styling, hide markup etc.
      org-hide-emphasis-markers t
      org-pretty-entities t
      org-agenda-tags-column 0
      org-ellipsis "…")

      (global-org-modern-mode))

#+END_SRC

** Evil mode (aka Vim mode)
*** Install package
#+NAME: evil-packages
#+BEGIN_SRC emacs-lisp
  
  ;; (defun dl/evil-hook ()
  ;;   (dolist (mode '(eshell-mode
  ;;                   git-rebase-mode
  ;;                   dashboard-mode
  ;;                   term-mode))
  ;;   (add-to-list 'evil-emacs-state-modes mode))) ;; no evil mode for these modes


  ;; (use-package evil
  ;;   :init
  ;;     (setq evil-want-integration t) ;; TODO: resear;; ch what this does
  ;;     (setq evil-want-keybinding nil) ;; Required for evil-collection
  ;;     (setq evil-want-fine-undo 'fine) ;; undo/redo each motion
  ;;     (setq evil-want-Y-yank-to-eol t) ;; Y copies to end of line like vim
  ;;     (setq evil-want-C-u-scroll t) ;; vim like scroll up
  ;;   :config
  ;;     (evil-mode 1)
  ;;     (dl/evil-hook)
  ;;     ;; Emacs "cancel" == vim "cancel"
  ;;     (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state))

  ;;   ;; Gives me vim bindings elsewhere in emacs
  ;;   (use-package evil-collection
  ;;     :after evil
  ;;     :init
  ;;   (setq evil-want-keybinding nil)
  ;;     ;; Define the variable before use
  ;;     (defvar evil-collection-mode-list nil)
  ;;     :config
  ;;     (setq evil-collection-mode-list (remove 'magit evil-collection-mode-list))
  ;;     (evil-collection-init))

  ;;   ;; Keybindings in org mode
  ;;   (use-package evil-org
  ;;   :after evil
  ;;   :hook
  ;;       (org-mode . evil-org-mode)
  ;;   :config
  ;;       (require 'evil-org-agenda)
  ;;       (evil-org-agenda-set-keys)
  ;;       ;; 🔑 включаем все ключевые темы
  ;;       (evil-org-set-key-theme '(navigation insert textobjects additional shift todo heading)))

  ;;   ;; Branching undo system
  ;;   (use-package undo-tree
  ;;     :after evil
  ;;     :diminish
  ;;     :config
  ;;     (evil-set-undo-system 'undo-tree)
  ;;     (global-undo-tree-mode 1))

  ;;   (use-package evil-commentary
  ;;     :after evil
  ;;     :config
  ;;     (evil-commentary-mode))

    ;; Keep undo files from littering directories
    (setq undo-tree-history-directory-alist '(("." . "~/.local/state/emacs/undo")))

#+END_SRC

** Managing files
*** File browser
#+BEGIN_SRC emacs-lisp
    (use-package nerd-icons-dired)

    (use-package dired
      :ensure nil
      :defer 1
      :commands (dired dired-jump)
      :config
        (setq dired-listing-switches "-agho --group-directories-first")
        (setq dired-hide-details-hide-symlink-targets nil)
        (put 'dired-find-alternate-file 'disabled nil)
        (setq delete-by-moving-to-trash t)
        (add-hook 'dired-load-hook
              (lambda ()
                (interactive)
                (dired-collapse)))
        (add-hook 'dired-mode-hook
              (lambda ()
                (interactive)
                (nerd-icons-dired-mode 1)
                (hl-line-mode 1))))
        (add-hook 'dired-mode-hook 'dired-hide-details-mode)t

    (use-package dired-ranger)
    (use-package dired-collapse)

    (require 'key-chord)
    (key-chord-mode 1)

    (key-chord-define-global "dd" (lambda() (interactive)
    (find-file "/Users/alexeykotomin/Downloads/")))
    (key-chord-define-global "ee" (lambda() (interactive)
    (find-file "/Users/alexeykotomin/.config/nix/modules/shared/config/emacs/")))
    (key-chord-define-global "bb" (lambda() (interactive)
    (find-file "/Users/alexeykotomin/Documents/library/")))
    (key-chord-define-global "ss" (lambda() (interactive)
    (find-file "/Users/alexeykotomin/s21_projects/")))

    (when (system-is-mac)
      (setq insert-directory-program
        (expand-file-name ".nix-profile/bin/ls" (getenv "HOME"))))
#+END_SRC

*** Backups and auto-save
These settings keep emacs from littering the filesystem with buffer backups. These files look like ~#yourfilename.txt#~ and would otherwise be dropped in your working directory.
#+NAME: backup-files
#+BEGIN_SRC emacs-lisp
(setq backup-directory-alist
      `((".*" . "~/.local/state/emacs/backup"))
      backup-by-copying t    ; Don't delink hardlinks
      version-control t      ; Use version numbers on backups
      delete-old-versions t) ; Automatically delete excess backups
#+END_SRC

#+NAME: local-file-transforms
#+BEGIN_SRC emacs-lisp
(setq auto-save-file-name-transforms
      `((".*" "~/.local/state/emacs/" t)))
(setq lock-file-name-transforms
      `((".*" "~/.local/state/emacs/lock-files/" t)))
#+END_SRC

