modules/shared/config/emacs/config.org
*** Books & Docs
#+NAME: pdfs
#+BEGIN_SRC emacs-lisp

  ;; Remember that the website version of this manual shows the latest
  ;; developments, which may not be available in the package you are
  ;; using.  Instead of copying from the web site, refer to the version
  ;; of the documentation that comes with your package.  Evaluate:
  ;;
  ;;     (info "(denote) Sample configuration")
  (use-package denote
    :ensure nil
    :hook (dired-mode . denote-dired-mode)
    :bind
    (("C-c n n" . denote)
     ("C-c n r" . denote-rename-file)
     ("C-c n l" . denote-link)
     ("C-c n b" . denote-backlinks)
     ("C-c n d" . denote-dired)
     ("C-c n g" . denote-grep))
    :config
    (setq denote-directory (expand-file-name "~/Documents/notes/"))

    ;; Automatically rename Denote buffers when opening them so that
    ;; instead of their long file name they have, for example, a literal
    ;; "[D]" followed by the file's title.  Read the doc string of
    ;; `denote-rename-buffer-format' for how to modify this.
    (denote-rename-buffer-mode 1))

  (use-package denote-markdown
   :ensure nil
   ;; Bind these commands to key bindings of your choice.
   :commands ( denote-markdown-convert-links-to-file-paths
     denote-markdown-convert-links-to-denote-type
     denote-markdown-convert-links-to-obsidian-type
     denote-markdown-convert-obsidian-links-to-denote-type ))
  (use-package citar
  :custom
  (citar-bibliography '("~/bib/references.bib")))

  (use-package pdf-tools
  :ensure nil
  :config
  (pdf-loader-install))
  (add-hook 'pdf-view-mode-hook
          (lambda ()
            (display-line-numbers-mode -1)))
#+END_SRC

** Managing projects
*** Projectile
#+NAME: projectile
#+BEGIN_SRC emacs-lisp
  (use-package ripgrep)
  (use-package projectile
    :config (projectile-mode)
    :custom
      ((projectile-completion-system 'ivy))
    :bind-keymap
	    ("C-c p" . projectile-command-map)
      :init
      (setq projectile-enable-caching t)
      (setq projectile-sort-order 'recently-active)
      (setq projectile-switch-project-action #'projectile-dired))

      ;; Пути к кэшу и списку проектов в ~/.config/emacs/
      (setq projectile-cache-file
        (expand-file-name "projectile.cache" ak/config-dir))
      (setq projectile-known-projects-file
        (expand-file-name "projectile-bookmarks.eld" ak/config-dir))

  (setq projectile-project-root-files-bottom-up '("package.json" ".projectile" ".project" ".git"))
  (setq projectile-ignored-projects '("~/.emacs.d/"))
  (setq projectile-globally-ignored-directories '("dist" "node_modules" ".log" ".git"))

  ;; Gives me Ivy options in the Projectile menus
  (use-package counsel-projectile 
    :after projectile
    :config
    (counsel-projectile-mode 1))
  
  ;; Project-wide search keybindings
  (defun my/swiper-project ()
    "Search across all files in current project using ripgrep."
    (interactive)
    (counsel-rg nil (projectile-project-root)))
  
  ;; Search keybindings for projectile
  (dl/leader-keys
    "/"   '(counsel-projectile-rg :which-key "search project")
    "?"   '(my/swiper-project :which-key "search project (alt)")
    "a"   '(:ignore t :which-key "search")
    "aa"  '(swiper-all :which-key "search buffers") 
    "ap"  '(counsel-projectile-rg :which-key "search project")
    "ag"  '(counsel-projectile-grep :which-key "grep project")
    "af"  '(counsel-projectile-find-file :which-key "find file")
    "ad"  '(counsel-projectile-find-dir :which-key "find directory"))
  
  ;; Alternative global keybindings for quick access
  (global-set-key (kbd "C-c C-s") 'counsel-projectile-rg)
  (global-set-key (kbd "C-c s p") 'my/swiper-project)
  (global-set-key (kbd "C-c s a") 'swiper-all)
#+END_SRC

** Coding
*** Compile buffers
Everything related to ~M-x compile~.
#+NAME: compilation-buffer
#+BEGIN_SRC emacs-lisp
;; Auto scroll the buffer as we compile
(setq compilation-scroll-output t)

;; By default, eshell doesn't support ANSI colors. Enable them for compilation.
(require 'ansi-color)
(defun colorize-compilation-buffer ()
  (let ((inhibit-read-only t))
    (ansi-color-apply-on-region (point-min) (point-max))))
(add-hook 'compilation-filter-hook 'colorize-compilation-buffer)
#+END_SRC
*** LSP
#+NAME: lsp-mode
#+BEGIN_SRC emacs-lisp
  (use-package lsp-mode
    :commands lsp lsp-deferred
    :init
      (setq lsp-keymap-prefix "C-c l")
      (setq lsp-restart 'ignore)
      (setq lsp-headerline-breadcrumb-enable nil)
      (setq lsp-auto-guess-root t)
      (setq lsp-enable-which-key-integration t))

  (use-package lsp-ui
    :hook (lsp-mode . lsp-ui-mode)
    :custom
      (lsp-ui-doc-position 'bottom))

  (use-package lsp-treemacs
    :after lsp)

  (use-package company
    :after lsp-mode
    :hook (lsp-mode . company-mode)
    :bind (:map company-active-map
          ("<tab>" . company-complete-selection))
          (:map lsp-mode-map
          ("<tab>" . company-indent-or-complete-common))
     :custom
       (company-minimum-prefix-length 1)
       (company-idle-delay 0.0))

  (use-package company-box
    :hook (company-mode . company-box-mode))

  (add-hook 'lsp-mode-hook #'lsp-headerline-breadcrumb-mode)
#+END_SRC

**** Shortcuts
Leader keys for ~lsp-mode~.

#+NAME: lsp-leader-keys
#+BEGIN_SRC emacs-lisp
  (defun dl/lsp-find-references-other-window ()
    (interactive)
    (switch-to-buffer-other-window (current-buffer))
    (lsp-find-references))

  (defun dl/lsp-find-implementation-other-window ()
    (interactive)
    (switch-to-buffer-other-window (current-buffer))
    (lsp-find-implementation))

  (defun dl/lsp-find-definition-other-window ()
    (interactive)
    (switch-to-buffer-other-window (current-buffer))
    (lsp-find-definition))

  (dl/leader-keys
  "l"  '(:ignore t :which-key "lsp")
  "lf" '(dl/lsp-find-references-other-window :which-key "find references")
  "lc" '(dl/lsp-find-implementation-other-window :which-key "find implementation")
  "ls" '(lsp-treemacs-symbols :which-key "list symbols")
  "lt" '(flycheck-list-errors :which-key "list errors")
  "lh" '(lsp-treemacs-call-hierarchy :which-key "call hierarchy")
  "lF" '(lsp-format-buffer :which-key "format buffer")
  "li" '(lsp-organize-imports :which-key "organize imports")
  "ll" '(lsp :which-key "enable lsp mode")
  "lr" '(lsp-rename :which-key "rename")
  "ld" '(dl/lsp-find-definition-other-window :which-key "goto definition"))
#+END_SRC

*** Languages
**** Python
#+NAME: python
#+BEGIN_SRC emacs-lisp
  (use-package lsp-pyright
    :ensure nil  ; Managed by Nix
    :hook (python-mode . (lambda ()
      (require 'lsp-pyright)
      (lsp-deferred))))  ; or lsp-deferred

  (setq python-indent-offset 2)

  (use-package blacken
    :ensure nil)

  (setq blacken-line-length '88)
  (setq blacken-allow-py36 t)
  (setq blacken-executable "black")
  (setq blacken-fast-unsafe t)

  (add-hook 'python-mode-hook 'blacken-mode)
#+END_SRC

**** Shell scripts
#+NAME: shell-scripts
#+BEGIN_SRC emacs-lisp
  (add-to-list 'auto-mode-alist '("\\.env" . shell-script-mode))
#+END_SRC

**** YAML
#+NAME: yaml-mode
#+BEGIN_SRC emacs-lisp
  (use-package yaml-mode
    :commands (markdown-mode gfm-mode)
    :mode (("\\.yml\\'" . yaml-mode)))
#+END_SRC

**** kbd 
#+NAME: kbd 
#+BEGIN_SRC emacs-lisp
  ;; Ассоциируем файлы .kbd с lisp-mode
  (add-to-list 'auto-mode-alist '("\\.kbd\\'" . lisp-mode))
#+END_SRC

*** Infrastructure
**** Nix
Nix is my package manager and operating system of choice; this mode enables me to have a better time writing Nix expressions.

#+NAME: nix-mode
#+begin_src emacs-lisp
  (use-package nix-mode
    :mode "\\.nix\\'")
#+end_src

** Learning Emacs
*** org-babel
**** Show popup hints
#+BEGIN_SRC emacs-lisp
(use-package which-key
  :ensure nil  ; Managed by Nix
  :init
  (setq which-key-idle-delay 0.3
        which-key-idle-secondary-delay 0.1)
  :config
  (which-key-mode))

(use-package helpful
  :ensure nil  ; Managed by Nix
  :commands (helpful-callable helpful-variable helpful-key)
  :bind
  ([remap describe-function] . helpful-callable)
  ([remap describe-command]  . helpful-callable)
  ([remap describe-variable] . helpful-variable)
  ([remap describe-key]      . helpful-key))
#+END_SRC

**** Load languages to run in org mode code blocks
#+BEGIN_SRC emacs-lisp
  (with-eval-after-load 'org
    (org-babel-do-load-languages
    'org-babel-load-languages
    '(
      (emacs-lisp . t)
      (python . t)
      (sql . t)
      (shell . t)))
   )
#+END_SRC

